{"config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activation": "relu", "batch_input_shape": [null, 500], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "name": "dense_5", "use_bias": true, "units": 512}, "class_name": "Dense"}, {"config": {"noise_shape": null, "trainable": true, "seed": null, "name": "dropout_1", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_6", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 256, "bias_constraint": null, "trainable": true, "activation": "sigmoid", "use_bias": true}, "class_name": "Dense"}, {"config": {"noise_shape": null, "trainable": true, "seed": null, "name": "dropout_2", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_7", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 2, "bias_constraint": null, "trainable": true, "activation": "softmax", "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.5"}